# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y).
def main():
    quarter_num = int(input('Введите номер четверти: '))
    if quarter_num < 1 and quarter_num > 4:
        print('Нет такой четверти')
    elif quarter_num == 1:
        print("X от 0 до бесконечности и Y от 0 до бесконечности.")
    elif quarter_num == 2:
        print("X от 0 до минус бесконечности и Y от 0 до бесконечности.")
    elif quarter_num == 3:
        print("X от 0 до минус бесконечности и Y от 0 до минус бесконечности.")
    elif quarter_num == 4:
        print("X от 0 до бесконечности и Y от 0 до минус бесконечности.")
        
main()